{
  "Education": {
    "Name": "UBC",
    "Bio": "The <a href=\"ubc.ca\">University of British Columbia</a> is one of the world's leading science universities. There, I'm a third-year pursuing an Honours Degree in Computer Science from the Faculty of Science.",
    "Activities": [
      {
        "Text": "am one of the ten 2021 <a href='https://www.schulichleaders.com/'>Schulich Leader Scholarship</a> recipients at the school. The Schulich Leader Scholarships are Canada's most prestigious STEM scholarship, valued at between $80k-100k CAD. Selected from over 1500 nominees across Canada, 100 scholarships are awarded nationally."
      },
      {
        "Text": "am Vice-President Academic at the UBC <a href='https://ubccsss.org/'>Computer Science Student Society</a>. I lead the team of webmasters as well as a team of academic officers, working to improve digital and academic experiences for students."
      }
    ],
    "Previously": "I attended the <a href='https://universitytransition.ca/'>University Transition Program</a> in Vancouver, a radically accelerated academic program preparing students for early entrance to UBC."
  },
  "Experience": [
    {
      "Position": "☁️ Cloudflare",
      "Date": "May - Aug. 2023",
      "Description": "Intern on [Cloudflare's](https://www.cloudflare.com/) [Queues](https://developers.cloudflare.com/queues/) team. I added [debugging features for Queues](https://blog.cloudflare.com/debug-queues-from-dash/) to the Cloudflare dashboard, which had a feature conversion rate of 50+%. I also performed service-wide migrations with Kubernetes and Helm, introduced E2E testing to the Queues frontend UI with Cypress, and created Grafana dashboards to track feature usage metrics."
    },
    {
      "Position": "👩‍🔬 UBC D-Lab",
      "Date": "Jan. - Apr. 2023",
      "Description": "Research assistant under Professors [Dongwook Yoon](https://dwyoon.com/), [Ivan Beschastnikh](https://www.cs.ubc.ca/~bestchai/), and [Cleidson de Souza](https://scholar.google.ca/citations?user=5kncGscAAAAJ&hl=en). I explored the characterization and identification of software engineering workflow types via network analysis, writing visualization scripts and queries in Python and Neo4j for the quantitative aspects of analysis."
    },
    {
      "Position": "⠕ Replit",
      "Date": "May - Aug. 2022",
      "Description": "Intern on [Replit's](https://replit.com/) Workspace team. I worked alongside another intern to own an end-to-end [migration of the GitHub import flow to Nix](https://blog.replit.com/nix-github-imports). Our work sped the flow up 2x and made Replit's import tool twice as fast than even Microsoft's GitHub Codespaces product. I also worked on a visual configuration editor for .replit files."
    },
    {
      "Position": "🔬 Summer Research School",
      "Date": "Jul. - Aug. 2021",
      "Description": "Attended the prestigious [Summer Research School](http://www.math.bas.bg/srs/newsite/srs/) in Bulgaria. There, a group of forty Bulgarian and international students pursue a research topic of their choice for three weeks, ultimately developing a formal paper and defending their findings with a presentation. Under the guidance of Ms. Pressiana Marinova, I worked on an inquiry project on probablistic primality testing and the analysis of a probablistic AKS variant. Read [the paper](https://github.com/kewbish/srs/tree/master/Primality.pdf) or [view source code](https://github.com/kewbish/srs/)."
    },
    {
      "Position": "🏆 Google Code-in",
      "Date": "Dec. 2019",
      "Description": "In 2019, I was a [Google Code-in](https://g.co/gci) winner, under Liquid Galaxy. For two months, I completed many open source tasks, and eventually won the competition. I'm one of Canada's ten winners to date and the youngest Canadian winner. As well: I was the youngest winner in 2019. Pretty cool."
    },
    {
      "Position": "🌎 Liquid Galaxy",
      "Date": "Since Feb. 2020",
      "Description": "Intern at [Liquid Galaxy](https://liquidgalaxy.eu), a Google-backed open source organization focused on interactive, immersive geographical displays. There, I develop documentation, webinar screencasts, and various other media, such as blog posts and installation tutorials. During summer 2020, I acted as a trainee mentor in several GSoC projects, as well as testing them."
    },
    {
      "Position": "💸 Grant For The Web Hackathon Winner",
      "Date": "May - Jun. 2020",
      "Description": "Won the [Grant For The Web Hackathon](https://dev.to/devteam/announcing-the-grant-for-the-web-hackathon-on-dev-3kd1) under the category *Creative Catalysts*, hosted by Dev.to, Mozilla, Coil, and Creative Commons. Created a revenue-sharing library from vanilla JS."
    },
    {
      "Position": "🐋 vhHacks",
      "Date": "Sep. 2020 - May 2021",
      "Description": "Team member at [vhHacks](https://vhhacks.ca/), the Vancouver High School Hackathon Association. I'm currently working on several Learn Day workshops and developing fun tooling for our 2021 hackathon."
    },
    {
      "Position": "🍁 Canada Learning Code",
      "Date": "Oct. 2019 - Jun. 2021",
      "Description": "Teen Ambassador at [Canada Learning Code](https://canadalearningcode.ca), a national organization reaching out to bring tech to women, girls, LGBTQ+ members, and focusing on making tech inclusive to all. There, I participate in team-building leadership activities, and learned effective mentorship skills."
    },
    {
      "Position": "📚 Vancouver Public Library",
      "Date": "Sep. 2018 - Jun. 2021",
      "Description": "Teen Advisory Member at the [Vancouver Public Library](https://vpl.ca), the local library serving Vancouver community members. There, I work to organize youth events, purchase youth books, provide feedback on programs, and attend biweekly youth meetings."
    }
  ]
}
