{
  "Projects": [
    {
      "Title": "🖋️ Yours, Kewbish",
      "Description": "My personal blog. Features a collection of tech-related tutorials, articles, and personal stories. ~105k words written so far.",
      "Github": "https://github.com/kewbish/blog",
      "Link": "https://kewbi.sh/blog"
    },
    {
      "Title": "🫖 Kintsugi",
      "Description": "A decentralized E2EE key recovery scheme allowing users to recover their key from a password while protecting from brute-force or recovery node collusion. I also developed a prototype implementation in Rust with Tauri and libp2p.",
      "Github": "https://github.com/kewbish/kintsugi"
    },
    {
      "Title": "🪺 NestedName",
      "Description": "A domain search tool facilitating domain hacks, like 'emilie.ma' or 'ma.tt', enabling users to find their ideal quirky domain. Email forwarding, link-in-bio sites, and vanity link shortening coming soon.",
      "Link": "https://nested.name"
    },
    {
      "Title": "🧢 Disparati",
      "Description": "Solutions for Fly.io's Gossip Glomers (Distributed Systems) challenges, including a globally-unique ID generator, a linearizable key-value store, and various CRDTs.",
      "Github": "https://github.com/kewbish/disparati"
    },
    {
      "Title": "🕸️ Cobweb",
      "Description": "An Ethereum-based Web Monetization Chrome extension enabling micro-payment streaming natively on the web. Won the <a href='https://docs.superfluid.finance/superfluid/resources/superfluid-wave-pool'>Superfluid.finance Wave Pool #5</a>.",
      "Github": "https://github.com/kewbish/cobweb",
      "Link": "https://kewbi.sh/cobweb"
    },
    {
      "Title": "🤝 PR-Issue Graph Topologies",
      "Description": "A collection of Python visualization scripts and Neo4j queries facilitating quantitative and qualitative analysis of GitHub collaboration patterns. See the paper <a href='https://dl.acm.org/doi/10.1145/3660813'>here</a>",
      "Github": "https://github.com/ubcdlab/pr-issue-topology-project"
    },
    {
      "Title": "👨‍🏫 Knetwork",
      "Description": "An offline-first educational system for remote communities, with infinite AI-generated problems and tests. Won the <a href='https://hack-the-change-2022.devpost.com/'>Hack The Change 2022 hackathon</a>.",
      "Github": "https://github.com/KevinL10/Knetwork",
      "Link": "https://devpost.com/software/knetwork"
    },
    {
      "Title": "🪵 woodchip8",
      "Description": "A Chip-8 emulator in Go. A toy project to learn Go and the <a href='https://github.com/hajimehoshi/ebiten'>Ebitengine game framework</a>.",
      "Github": "https://github.com/kewbish/woodchip8"
    },
    {
      "Title": "🔬 Primality Testing",
      "Description": "Worked on an inquiry project on probabilistic primality testing and the analysis of a probabilistic AKS variant.",
      "Github": "https://github.com/kewbish/srs",
      "Link": "https://github.com/kewbish/srs/tree/master/Primality.pdf"
    },
    {
      "Title": "📊 UMLie",
      "Description": "A UML diagram generator built in Java. Parses file imports and association types (fields, aggregations, etc.) to create several types of diagrams.",
      "Github": "https://github.com/kewbish/umlie"
    },
    {
      "Title": "🌊 DiveIntoHT.ML",
      "Description": "An interactive short course designed to teach the basics of web design. Accumulated ~400 registered users and receives ~1k monthly pageviews.",
      "Github": "https://github.com/kewbish/sjap/",
      "Link": "https://diveintoht.ml"
    },
    {
      "Title": "⚛️  Matter",
      "Description": "A minimalist RSS reader and bookmarking tool, built with vanilla JS and GitHub integrations. Meant as a personal replacement for clunky readers.",
      "Github": "https://github.com/kewbish/matter/",
      "Link": "https://kewbi.sh/matter/"
    },
    {
      "Title": "💸 Revshare.js",
      "Description": "A lightweight Javascript library to bring easy revenue-sharing capabilities to any site. Won the Grant For The Web Hackathon grand prize.",
      "Github": "https://github.com/kewbish/revshare",
      "Link": "https://kewbi.sh/revshare/"
    },
    {
      "Title": "💵 Revshare for GitHub",
      "Description": "A Chrome extension, bringing Web Monetization technologies to GitHub. Allows creators of any repo and its dependencies to receive revenue through the Web Monetization API.",
      "Github": "https://github.com/kewbish/revshare-gh"
    },
    {
      "Title": "🗽 Liberty",
      "Description": "A Terminal User Interface built to bring the Leitner box space repetition technique to the terminal. Implements a text-based SRS system with open-ended question features.",
      "Github": "https://github.com/kewbish/liberty",
      "Link": "https://pypi.org/project/liberty-tui/"
    },
    {
      "Title": "🎮 rack8",
      "Description": "A Chip-8 emulator in Racket. A toy project for me to learn the basics of emulator development and Racket.",
      "Github": "https://github.com/kewbish/rack8"
    }
  ],
  "Talks": [
    {
      "Title": "💾 Neo4j NODES 2024",
      "Description": "An online developer conference hosted by Neo4j, the graph DB tool. Presented my research on the GitHub PR-Issue graph, how we analyzed it with Neo4j and Cypher, and takeaways for open source developers.",
      "Link": "https://www.youtube.com/watch?v=xFtwCuRj-Wg"
    },
    {
      "Title": "🌐 Open Source Summit North America 2024 (🟊)",
      "Description": "North America's premier open source conference, with keynotes from community figureheads (like Linus Torvalds!) Presented my research on the GitHub PR-Issue graph, including the prototypical workflow types we identified and their implications for open source maintainers. I also wrote an accompanying blog post [here](https://kewbi.sh/blog/posts/240602/), and the slides are available in a blog post format [here](https://kewbi.sh/blog/posts/240526/).",
      "Link": "https://www.youtube.com/watch?v=iUZaW_cjwYU"
    },
    {
      "Title": "⌨️ NeovimConf 2023",
      "Description": "An online conference on the Vim/Neovim text editor, featuring talks from core maintainers and community members. Presented a lightning talk on my Vim-based personal notetaking system, built around Neovim, FZF, and RipGrep.",
      "Link": "https://www.youtube.com/watch?v=1a6AEJxH_Dk"
    },
    {
      "Title": "🧠 Augment Minds 2021",
      "Description": "An (un)conference on advancing technologies in the tools for thought space, and delightful innovations in HCI for complementing thought. Delivered a lightning talk on a plaintext Zettelkasten system and my toolkit of choice: Vim, FZF, RipGrep, and Ctags.",
      "Link": "https://kewbi.sh/blog/posts/210815/"
    }
  ],
  "Uses": {
    "Languages": [
      "**Frontend Development** - React, Typescript, Node, Next, Express, Jest, Vue",
      "**Backend Development** - Python (Flask), Go, Node, Java, Serverless / Distributed Architectures, Docker, Kubernetes",
      "**Databases** - MySQL, PostgreSQL, Oracle, Neo4j, GraphQL, MongoDB, SQLite, Firebase",
      "**Misc.** - C, Unity + C#, Vim + Vimscript, Unix/Linux systems, Grafana"
    ]
  }
}
